Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: Someday, someone will get the bright idea to implement a <firstterm>reply-to-list</firstterm> key in a mail reader. It would use some of the custom list headers mentioned earlier to figure out the address of the mailing list, and then address the reply directly to the list only, leaving off any other recipient addresses, since most are probably subscribed to the list anyway. Eventually, other mail readers will pick up the feature, and this whole debate will go away. (Actually, the <ulink url="http://www.mutt.org/">Mutt</ulink> mail reader does offer this feature.<footnote><para>Shortly after this book appeared, <ulink url="http://www.michaelbernstein.com/">Michael Bernstein</ulink> wrote me to say: "There are other email clients that implement a reply-to-list function besides Mutt. For example, Evolution has this function as a keyboard shortcut, but not a button (Ctrl+L)."</para></footnote>)
gl: Algún día, alguén vai ter a feliz idea de implementar unha tecla <firstterm>"responder á lista"</firstterm> no seu software de correo electrónico. Empregará algún dos cabezallos estándar mencionados anteriormente para deducir o enderezo da lista, e entón dirixir as respostas tan só á lista, deixando de lado todas os demais enderezos dos destinatarios, xa que os máis deles estarán, de todos modos, subscritos. É posible que outros programas de correo copien a idea, e todo este debate desapareza finalmente. (De feito, o programa <ulink url="http://www.mutt.org/">Mutt</ulink> ofrece xa esta característica.<footnote><para>Pouco despois de que este libro fora publicado, <ulink url="http://www.michaelbernstein.com/">Michael Bernstein</ulink> escribiume para dicirme: "Hai outros programas de correo que incorporan una función de "responder á lista" ademais de Mutt. Por exemplo, Evolution ten esta función en forma de atallo de teclas, aínda que non cun botón (Ctrl+L)."</para></footnote>)

source: An even better solution would be for Reply-to munging to be a per-subscriber preference. Those who want the list to set Reply-to munged (either on others' posts or on their own posts) could ask for that, and those who don't would ask for Reply-to to be left alone. However, I don't know of any list management software that offers this on a per-subscriber basis. For now, we seem to be stuck with a global setting.
gl: Unha solución aínda mellor sería que a opción de "responder a" estivese da parte de quen resposta. Aqueles que desexan que a lista teña o "responder a" preconfigurado (ben nas mensaxes dos outros ou nas propias) poderían escoller esta opción, e os demais escollerían que o "responder a" fose escollido por casa usuario. Porén, non coñezo ningún programa que o faga. De momento, parece que estamos estancados na opción da solución global.

source: Since I wrote that, I've learned that there is at least one list management system that offers this feature: <ulink url="http://siesta.unixbeard.net/">Siesta</ulink>. See also this article about it: <ulink url="http://www.perl.com/pub/a/2004/02/05/siesta.html"></ulink>
gl: Desde que escribín o anterior, descubrín que hai polo menos un sistema de xestión de listas que ofrece esta posibilidade: <ulink url="http://siesta.unixbeard.net/">Siesta</ulink>. Tamén podes ler este artigo: <ulink url="http://www.perl.com/pub/a/2004/02/05/siesta.html"></ulink>

source: <title>Archiving</title>
gl: <title>Arquivamento</title>

source: The technical details of setting up mailing list archiving are specific to the software that's running the list, and are beyond the scope of this book. When choosing or configuring an archiver, consider these qualities:
gl: Os detalles técnicos acerca da configuración do arquivamento de listas de correo son específicos do software que xestiona a lista, e ultrapasan o ámbito deste libro. Cando escollas ou configures un arquivador, ten en conta as seguintes características:

source: Prompt updating
gl: Actualización áxil

source: People will often want to refer to an archived post made within the last hour or two. If possible, the archiver should archive each post instantaneously, so that by the time a post appears on the mailing list, it's already present in the archives. If that option isn't available, then at least try to set the archiver to update itself every hour or so. (By default, some archivers run their update processes once per night, but in practice that's far too much lag time for an active mailing list.)
gl: Frecuentemente a xente vai querer referirse a unha mensaxe enviada durante as últimas dúas horas. Se for posible, o arquivador debería almacenar cada mensaxe instantaneamente, de xeito que en canto aparece na lista de correo estea xa dispoñible nos arquivos da mesma. Se esa opción non estiver dispoñible, entón tenta cando menos configurar o arquivador para que se actualice cada hora. Por defecto, algúns arquivadores lanzan os seus procesos de actualización unha vez cada noite, mais iso supón unha demora claramente inasumible para unha lista de correo medianamente activa.

source: Referential stability
gl: Estabilidade referencial

source: Once a message is archived at a particular URL, it should remain accessible at that exact same URL forever, or as close to forever as possible. Even if the archives are rebuilt, restored from backup, or otherwise fixed, any URLs that have already been made publicly available should remain the same. Stable references make it possible for Internet search engines to index the archives, which is a major boon to users looking for answers. Stable references are also important because mailing list posts and threads are often linked to from the bug tracker (see <xref linkend="bug-tracker"/><phrase output="printed"> later in this chapter</phrase>) or from other project documents.
gl: Cando unha mensaxe é arquivada nunha URL dada, debería permanecer accesible para sempre nese mesmo enderezo, ou durante tanto tempo como for posible. Mesmo se os arquivos son reconstruídos, restaurados desde un ficheiro de respaldo (backup), ou reparados de calquera outra maneira, as URL que foran publicamente accesibles nun momento dado deben permanecer accesibles. As referencias estables fan posible que os motores de procura en Internet indexen correctamente os arquivos, o que supón unha vantaxe considerable para usuarios que buscan respostas a preguntas concretas. As estabilidade das referencias é tamén importante porque as mensaxes e fíos das listas de correo acostuman estar enlazadas ao xestor de erros (bug tracker) (véxase <xref linkend="bug-tracker"/><phrase output="printed"> máis adiante neste capítulo</phrase>) ou a outros documentos do proxecto.

source: Ideally, mailing list software would include a message's archive URL, or at least the message-specific portion of the URL, in a header when it distributes the message to recipients. That way people who have a copy of the message would be able to know its archive location without having to actually visit the archives, which would be helpful because any operation that involves one's web browser is automatically time-consuming. Whether any mailing list software actually offers this feature, I don't know; unfortunately, the ones I have used do not. However, it's something to look for (or, if you write mailing list software, it's a feature to consider implementing, please).
gl: Idealmente, o software de listas de correo debería incluir a URL do arquivo de mensaxes, ou polo menos a parte específica da URL que se refire á mensaxe, nun cabezallo, cando distribúa as mensaxes aos seus destinatarios. Deste xeito, a xente que ten unha copia da mensaxe coñecerá a localización do seu arquivo sen ter que ver realmente os arquivos, o que é moi útil porque calquera operación que implica o uso do navegador de Internet supón necesariamente un certo consumo de tempo. Non sei se todo o software de listas de correo ofrece esta característica; infelizmente, os que eu teño usado non o fan. Porén, é algo sobre o que pesquisar (ou, se escribires software para listas de correo, é unha característica que deberías considerar implementar, por favor)

source: Backups
gl: Copias de seguridade (Backups)

source: It should be reasonably obvious how to back up the archives, and the restoration recipe should not be too difficult. In other words, don't treat your archiver as a black box. You (or someone in your project) should know where it's storing the messages, and how to regenerate the actual archive pages from the message store if it should ever become necessary. Those archives are precious data&mdash;a project that loses them loses a good part of its collective memory.
gl: Como facer copias de seguridade dos arquivos debería ser razoablemente obvio, e a receita de restauración non debería ser moi difícil. Noutras palabras, non trates o teu arquivador como unha caixa negra. Ti (ou alguén do teu proxecto) deberías saber onde se almacenan as mensaxes, e como rexenerar as páxinas de arquivamento desde o almacén de mensaxes no caso de que nalgún momento fose necesario. Eses arquivos conteñen datos preciosos&mdash;un proxecto que os perde, perde tamén unha parte considerable da súa memoria colectiva.

source: Thread support
gl: Soporte aos fíos (Threads)

source: It should be possible to go from any individual message to the <firstterm>thread</firstterm> (group of related messages) that that original message is part of. Each thread should have its own URL too, separate from the URLs of the individual messages in the thread.
gl: Debería ser posible ir dunha mensaxe dada ao correspondente <firstterm>fío</firstterm> (grupo de mensaxes relacionadas entre si) ao que pertence esa mensaxe en particular. Cada fío debería tamén ter a súa propia URL, distinta das correspondentes ás mensaxes que compoñen o fío.

source: Searchability
gl: Pesquisas

source: An archiver that doesn't support searching&mdash;on the bodies of messages, as well as on authors and subjects&mdash;is close to useless. Note that some archivers support searching by simply farming the work out to an external search engine such as <ulink url="http://www.google.com/">Google</ulink>. This is acceptable, but direct search support is usually more fine-tuned, because it allows the searcher to specify that the match must appear in a subject line versus the body, for example.
gl: Un arquivador que non soporte pesquisas&mdash;sobre os corpos das mensaxes, e sobre os seus autores ou asuntos&mdash;é cáseque inútil. Ten en conta que algúns arquivadores soportan pesquisas simplemente derivándoas a un motor externo tal como <ulink url="http://www.google.com/">Google</ulink>. Isto é aceptable, mais o soporte a pesquisas directas normalmente permite un mellor afinado, xa que deixa que a ferramenta de procura especifique que o resultado debe procurarse na liña de asunto e non no corpo, por exemplo.

source: The above is just a technical checklist to help you evaluate and set up an archiver. Getting people to actually <emphasis>use</emphasis> the archiver to the project's advantage is discussed in later chapters, in particular <xref linkend="using-archives"/>.
gl: O que antecede é simplemente unha lista de control para axudarte a avaliar e configurar un arquivador. Conseguir que a xente faga un <emphasis>uso</emphasis> real do arquivador en beneficio do proxecto se discute en capítulos posteriores, nomeadamente en <xref linkend="usando-arquivos"/>.

source: Here are some open source tools for doing list management and archiving. If the site where you're hosting your project already has a default setup, then you may not ever have to decide on a tool at all. But if you must install one yourself, these are some possibilities. The ones I have actually used are Mailman, Ezmlm, MHonArc, and Hypermail, but that doesn't mean the others aren't good too (and of course, there are probably other tools out there that I just didn't happen to find, so don't take this as a complete list).
gl: De seguido se comentan algunhas ferramentas de software libre para a xestión e o arquivamento de listas de correo. Se o sitio no que tes o teu proxecto aloxado ten xa unha configuración por defecto, non vas ter que escoller ningunha ferramenta en particular. Mais si vas ter que instalar unha por ti mesmo, estas son algunhas das posibles. As que eu teño usado son Mailman, Ezmlm, MHonArc, e Hypermail, mais iso non quere decir que non haxa outras igual de boas ( e seguro que existen por aí adiante outras ferramentas que eu nin sequera dei atopado, así que non penses que esta é unha lista completa).

source: Mailing list management software:
gl: Software de xestión de listas de correo:

source: (Has built-in archiver, and hooks for plugging in external archivers.)
gl: (Ten un arquivador incorporado, así como conexións para arquivadores externos)

source: (Meant to be used with the Procmail mail processing system.)
gl: (Deseñado para ser usado co sistema de procesamento de correo electrónico Procmail)

source: (Designed to work with the <ulink url="http://cr.yp.to/qmail.html">Qmail</ulink> mail delivery system.)
gl: (Deseñado para traballar co sistema de distribución de correo <ulink url="http://cr.yp.to/qmail.html">Qmail</ulink>)

source: (Despite the web site's bizarre attempts to hide the fact, this is free software, released under the GNU General Public License. It also has a built-in archiver.)
gl: (Embora os insistentes esforzos da súa web para ocultalo, é software libre, liberado baixo a licencia GNU. Tamén inclúe un arquivador)

source: Mailing list archiving software:
gl: Software de arquivamento de listas de correo:

source: (Companion software to SmartList, this is a general mail processing system that can, apparently, be configured as an archiver.)
gl: (Software de acompañamento de Smartlistk, é un sistema procesador de correo que pode, aparentemente, ser configurado como arquivador)

source: Version Control
gl: Control de versións

source: A <firstterm>version control system</firstterm> (or <firstterm>revision control system</firstterm>) is a combination of technologies and practices for tracking and controlling changes to a project's files, in particular to source code, documentation, and web pages. If you have never used version control before, the first thing you should do is go find someone who has, and get them to join your project. These days, everyone will expect at least your project's source code to be under version control, and probably will not take the project seriously if it doesn't use version control with at least minimal competence.
gl: Un <firstterm>sistema de control de versións</firstterm> (ou <firstterm>sistema de control de revisións</firstterm>) é unha combinación de tecnoloxías e prácticas para facer seguimento e control das mudanzas que se van producindo nos ficheiros dun proxecto, nomeadamente nos de código fonte, documentación e páxinas web. Se nunca antes usaches control de versións, o primeiro que deberías facer é buscar alguén que si o teña usado e fichalo para o teu proxecto. Hoxe en día, todo o mundo espera que cando menos o código fonte do teu proxecto estea subido a un sistema de control de versións, e seguramente non se tomará o proxecto en serio se non se utiliza este sistema cun mínimo de solvencia.

source: The reason version control is so universal is that it helps with virtually every aspect of running a project: inter-developer communications, release management, bug management, code stability and experimental development efforts, and attribution and authorization of changes by particular developers. The version control system provides a central coordinating force among all of these areas. The core of version control is <firstterm>change management</firstterm>: identifying each discrete change made to the project's files, annotating each change with metadata like the change's date and author, and then replaying these facts to whoever asks, in whatever way they ask. It is a communications mechanism where a change is the basic unit of information.
gl: A razón pola que o control de versións é tan universal é que axuda a practicamente todos e cada un dos aspectos relacionados coa xestión dun proxecto: comunicacións entre desenvolvedores, xestión de liberacións, seguimento de erros (bug tracking), estabilidade do código e esforzos de desenvolvemento experimental, e atribución e autorización de mudanzas por certos desenvolvedores. O sistema de control de versións ofrece un centro de mando para todas estas tarefas. O núcleo do control de versións reside na <firstterm>xestión de mudanzas</firstterm>: identificando cada mudanza concreta realizada aos ficheiros do proxecto, anotando cada mudanza con metadatos tales como a súa data e o seu autor, e repetindo estes procesos para quen o solicitar, sen importar como. É un mecanismo de comunicación no que a mudanza é a unidade básica de información.

source: This section does not discuss all aspects of using a version control system. It's so all-encompassing that it must be addressed topically throughout the book. Here, we will concentrate on choosing and setting up a version control system in a way that will foster cooperative development down the road.
gl: Esta sección non vai revisar a totalidade dos aspectos derivados do uso dun sistema de control de versións. É tan transversal que vai ser comentado ao longo do libro. Aquí concentrarémonos na escolla e a configuración dun sistema de control de versións de xeito que facilite o desenvolvemento cooperativo durante a existencia do proxecto.

source: Version Control Vocabulary
gl: Vocabulario do control de versións

source: This book cannot teach you how to use version control if you've never used it before, but it would be impossible to discuss the subject without a few key terms. These terms are useful independently of any particular version control system: they are the basic nouns and verbs of networked collaboration, and will be used generically throughout the rest of this book. Even if there were no version control systems in the world, the problem of change management would remain, and these words give us a language for talking about that problem concisely.
gl: Este libro non pode aprenderte a usares o control de versións se nunca antes o usaches, mais sería imposible falar sobre a materia sen definirmos primeiro algúns conceptos chave. Estes termos son útiles independentemente do sistema de control de versións seleccionado: son os verbos e substantivos básicos da colaboración en rede, e serán usados de xeito xenérico ao longo da obra. Aínda que non existisen sistemas de control de versións, o problema da xestión de mudanzas persistiría, e estes termos vannos fornecer unha linguaxe para falar concisamente deste problema.

source: To make a change to the project; more formally, to store a change in the version control database in such a way that it can be incorporated into future releases of the project. "Commit" can be used as a verb or a noun. As a noun, it is essentially synonymous with "change". For example: "I just committed a fix for the server crash bug people have been reporting on Mac OS X. Jay, could you please review the commit and check that I'm not misusing the allocator there?"
gl: Facer unha mudanza no proxecto; máis formalmente, almacenar unha mudanza na base de datos de control de versións de tal xeito que poida ser incorporada en futuras versións do proxecto. En inglés, "commit" pode ser usado como substantivo ou como verbo. Como substantivo, pode ser considerado como sinónimo de "mudanza". En galego a forma verbal pode ser substituída por "facer un commit". Por exemplo: "fixen o commit dun remendo para o fallo de servidores en Mac OS X que os de xestión de erros estaban a comentar. Jay, poderías revisar a mudanza e comprobar que non estou a facer mal uso do localizador (allocator)?"

source: log&nbsp;message
gl: mensaxe de log&nbsp;

source: A bit of commentary attached to each commit, describing the nature and purpose of the commit. Log messages are among the most important documents in any project: they are the bridge between the highly technical language of individual code changes and the more user-oriented language of features, bugfixes, and project progress. Later in this section, we'll look at ways to distribute log messages to the appropriate audiences; also, <xref linkend="codifying-tradition"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses ways to encourage contributors to write concise and useful log messages.
gl: Un pequeno comentario engadido a cada commit, describindo a natureza e o propósito da mudanza. As mensaxes de log cóntanse entre os documentos máis importantes dun proxecto: constitúen a ponte entre a linguaxe altamente técnica das mudanzas no código e a máis orientada aos usuarios de características, remendo de erros e progreso do proxecto. Máis adiante nesta sección, falaremos de como distribuír as mensaxes de log ás audiencias apropiadas; tamén, <xref linkend="codifying-tradition"/><phrase output="printed"> en <xref linkend="communications"/></phrase> se discute acerca dos modos en que os contribuíntes deben escribir mensaxes de log sinxelas e útiles.

source: update
gl: actualizar (update)

source: To ask that others' changes (commits) be incorporated into your local copy of the project; that is, to bring your copy "up-to-date". This is a very common operation; most developers update their code several times a day, so that they know they're running roughly the same thing the other developers are running, and so that if they see a bug, they can be pretty sure it hasn't been fixed already. For example: "Hey, I noticed the indexing code is always dropping the last byte. Is this a new bug?" "Yes, but it was fixed last week&mdash;try updating, it should go away."
gl: Solicitar que as mudanzas (commits) feitas por outros se incorporen á túa copia local do proxecto; isto é, actualizar a túa copia. É unha operación moi frecuente; os máis dos desenvolvedores actualizan o seu código varias veces ao longo do día, de xeito que están seguros de estar traballando sobre cáseque o mesmo código sobre o que están a traballar os outros colaboradores, e se eles atopan un erro, poden estar bastante seguros de que aínda non foi reparado. Por exemplo: "Ei!, decateime de que o código de indexación perde o último byte constantemente. Trátase dun novo erro?" "Si, mais foi corrixido hai unha semana&mdash;tenta facer unha actualización, debería solucionarse."

source: repository
gl: repositorio
